KnowledgeLake Search Mobile/app/services/sharepoint/soapTemplates/Lists/GetListItems.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Body>
		<GetListItems xmlns="http://schemas.microsoft.com/sharepoint/soap/">
			<listName>{listName}</listName>
			<viewName>{viewName}</viewName>
			<query>{query}</query>
			<viewFields>{viewFields}</viewFields>
			<rowLimit>{rowLimit}</rowLimit>
			<queryOptions>{queryOptions}</queryOptions>
			<webID>{webID}</webID>
		</GetListItems>
	</soap:Body>
</soap:Envelope>